Stellarhold170NT/wallhack/firmware/esp32-csi-node/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_WIFI_CSI_ENABLED=y
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_LWIP_IPV4=y

# Default network config (overridable via NVS)
CONFIG_CSI_WIFI_SSID="wifi-densepose"
CONFIG_CSI_WIFI_PASSWORD=""
CONFIG_CSI_TARGET_IP="192.168.1.100"
CONFIG_CSI_TARGET_PORT=5005
CONFIG_CSI_NODE_ID=1
CONFIG_CSI_WIFI_CHANNEL=6

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
